app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."team_name" = ?  [["team_name", "test"]]
SELECT "users".* FROM "users"
---
   def index
    @team = current_user.team_name
    @current_user = current_user
    @users = User.where(team_name: @team)
    @all_users = User.all

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "team_name", "age", "phone_number", "admin") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "team_name" = ? WHERE "users"."id" = ?  [["updated_at", "2021-04-12 01:46:35.390749"], ["team_name", "test tea"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
def correct_user
      @user = User.find(params[:id])