app/models/user.rb

SELECT COUNT(*) FROM "users"
---
  def check_to_make_admin
    # Only the first user should be made admin
    if User.count == 0